app/Controllers/Api/UserController.php

INSERT INTO `users` (`name`, `email`, `password`) VALUES ('Tania', 'tania@hotmail.com', '$2y$10$szHYohy2/vCGTpXUD3WD2u5ts15JXZatUp7Gu6y3cQesydm81L/4q')
---
                "password" => password_hash($this->request->getVar("password"), PASSWORD_DEFAULT),
            ];

            if ($userModel->insert($data)) {

SELECT *
FROM `users`
WHERE `email` = 'oriol@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $rules = [
            "email" => "required|valid_email|min_length[6]",
            "password" => "required",
        ];

        $messages = [
            "email" => [
                "required" => "Email required",
                "valid_email" => "Email not valid"
            ],
            "password" => [
                "required" => "Password is required"
            ],
        ];

        if (!$this->validate($rules, $messages)) {

            $response = [
                'status' => 500,
                'error' => true,
                'messages' => $this->validator->getErrors(),
                'data' => []
            ];

        } else {
            $userModel = new UserModel();

            $userdata = $userModel->where("email", $this->request->getVar("email"))->first();

SELECT *
FROM `users`
WHERE `users`.`id` = '31'
---
    public function showUser($user_id)
	{
		$user = new UserModel();

		$data = $user->find($user_id);